{
  "phan_i": [
    {
      "question_id": 1,
      "source": "Unknown",
      "question_text": "Năm 1967, ở Đông Nam Á diễn ra sự kiện lịch sử nào sau đây?",
      "options": {
        "A": "Cộng đồng ASEAN ra đời.",
        "B": "Tổ chức ASEAN ra đời",
        "C": "Liên hợp quốc được thành lập.",
        "D": "Cuba tiến lên chủ nghĩa xã hội."
      },
      "correct_answer": "B",
      "explanation": {
        "method": "SGK Lịch sử 12, nội dung Hội nghị các nước Đông Nam Á (ASEAN).",
        "solution": "Năm 1967, ở Đông Nam Á đã diễn ra sự kiện lịch sử là tổ chức ASEAN ra đời."
      }
    },
    {
      "question_id": 2,
      "source": "Unknown",
      "question_text": "Ngày 2-9-1945, tại Quảng trường Ba Đình (Hà Nội), Chủ tịch Hồ Chí Minh đã",
      "options": {
        "A": "đọc Lời kêu gọi toàn quốc kháng chiến.",
        "B": "phát lệnh Tổng khởi nghĩa.",
        "C": "công bố Chỉ thị Toàn dân kháng chiến.",
        "D": "đọc bản Tuyên ngôn Độc lập."
      },
      "correct_answer": "D",
      "explanation": {
        "method": "SGK Lịch sử 12, nội dung Cách mạng tháng Tám năm 1945.",
        "solution": "Ngày 2-9-1945, tại Quảng trường Ba Đình (Hà Nội), Chủ tịch Hồ Chí Minh đã đọc bản Tuyên ngôn Độc lập."
      }
    },
    {
      "question_id": 3,
      "source": "Unknown",
      "question_text": "Ở Việt Nam, phong trào \"Đồng Khởi\" (1959-1960) và Cách mạng tháng Tám 1945 có điểm tương đồng nào sau đây?",
      "options": {
        "A": "Hoàn thành cuộc cách mạng ruộng đất.",
        "B": "Bước đầu giành được độc lập dân tộc.",
        "C": "Lực lượng vũ trang đóng vai trò quyết định.",
        "D": "Thành lập được chính quyền cách mạng."
      },
      "correct_answer": "D",
      "explanation": {
        "method": "So sánh, loại trừ đáp án",
        "solution": "Phong trào \"Đồng Khởi\" (1959-1960) và Cách mạng tháng Tám năm 1945 đều có điểm tương đồng là thành lập được chính quyền cách mạng."
      }
    },
    {
      "question_id": 4,
      "source": "Unknown",
      "question_text": "Nội dung nào sau đây không phải ý nghĩa của phong trào Tây Sơn (cuối thế kỷ XVIII) ở Việt Nam?",
      "options": {
        "A": "Lật đổ chính quyền chúa Nguyễn, chúa Trịnh, vua Lê.",
        "B": "Đánh thắng quân Xiêm và Thanh, bảo vệ độc lập dân tộc.",
        "C": "Đưa triều đại nhà Lê sơ trong lịch sử.",
        "D": "Thể hiện ý chí đấu tranh chống áp bức của nhân dân ta."
      },
      "correct_answer": "C",
      "explanation": {
        "method": "SGK Lịch sử 11.",
        "solution": "Việc đưa triều đại nhà Lê sơ trong lịch sử không phải là ý nghĩa của phong trào Tây Sơn (cuối thế kỷ XVIII) ở Việt Nam."
      }
    },
    {
      "question_id": 5,
      "source": "Unknown",
      "question_text": "Đặc điểm nào sau đây khiến cho Việt Nam thường xuyên bị các thế lực bên ngoài nhòm ngó, xâm lược?",
      "options": {
        "A": "Có lãnh thổ rộng lớn nhất châu Á.",
        "B": "Có vị trí địa chiến lược quan trọng.",
        "C": "Chế độ phong kiến luôn khủng hoảng.",
        "D": "Trữ lượng lớn về tài nguyên dầu khí."
      },
      "correct_answer": "B",
      "explanation": {
        "method": "Giải thích",
        "solution": "Vị trí địa chiến lược quan trọng của Việt Nam khiến nó thường xuyên bị các thế lực bên ngoài nhòm ngó, xâm lược."
      }
    }
  ],
  "phan_ii": [
    
  ]
}