{
  "phan_i": [
    {
      "question_id": 1,
      "source": "Tuyen Quang",
      "question_text": "Một trong những điểm tương đồng của Cách mạng tháng Tám năm 1945 và hai cuộc kháng chiến chống ngoại xâm (1945 - 1975) ở Việt Nam là:",
      "options": {
        "A": "có sự sáng tạo trong phương thức sử dụng lực lượng.",
        "B": "lực lượng vũ trang giữ vai trò quyết định thắng lợi.",
        "C": "có sự kết hợp đấu tranh quân sự, chính trị và ngoại giao.",
        "D": "có sự giúp đỡ của các nước xã hội chủ nghĩa."
      },
      "correct_answer": "A",
      "explanation": {
        "method": "So sánh nội dung Cách mạng tháng Tám năm 1945 và các cuộc kháng chiến chống Pháp, Mỹ.",
        "solution": "Trong Cách mạng tháng Tám năm 1945, lực lượng chính trị giữ vai trò quyết định; không có đấu trường ngoại giao và hệ thống xã hội chủ nghĩa chưa hình thành. Do đó, A là đáp án đúng."
      }
    },
    {
      "question_id": 2,
      "source": "Tuyen Quang",
      "question_text": "Trung tâm của cuộc cải cách, mở cửa ở Trung Quốc (từ tháng 12 - 1978) là:",
      "options": {
        "A": "lấy phát triển kinh tế làm trọng tâm.",
        "B": "chú trọng phát triển văn hóa, giáo dục.",
        "C": "lấy cải tổ chính trị làm trọng tâm.",
        "D": "tập trung cải cách triệt để về kinh tế."
      },
      "correct_answer": "A",
      "explanation": {
        "method": "Xem lại nội dung cải cách ở Trung Quốc sau năm 1978.",
        "solution": "Cuộc cải cách và mở cửa ở Trung Quốc từ năm 1978 lấy phát triển kinh tế làm trọng tâm."
      }
    },
    {
      "question_id": 3,
      "source": "Tuyen Quang",
      "question_text": "Chiều ngày 16-8-1945, một đơn vị Giải phóng quân do Võ Nguyên Giáp chỉ huy, xuất phát từ Tân Trào tiến về giải phóng thị xã:",
      "options": {
        "A": "Thái Nguyên.",
        "B": "Tuyên Quang.",
        "C": "Cao Bằng.",
        "D": "Lào Cai."
      },
      "correct_answer": "A",
      "explanation": {
        "method": "Xem lại nội dung Cách mạng tháng Tám năm 1945.",
        "solution": "Chiều ngày 16-8-1945, đơn vị Giải phóng quân do Võ Nguyên Giáp chỉ huy xuất phát từ Tân Trào tiến về giải phóng Thái Nguyên."
      }
    },
    {
      "question_id": 4,
      "source": "Tuyen Quang",
      "question_text": "Sự hình thành xu thế đa cực, nhiều trung tâm sau Chiến tranh lạnh có tác động như thế nào đối với tình hình thế giới và quan hệ quốc tế?",
      "options": {
        "A": "Ngăn chặn được mọi cuộc chiến tranh, xung đột.",
        "B": "Góp phần củng cố hòa bình, an ninh quốc tế.",
        "C": "Mở ra quá trình hình thành của xu thế toàn cầu hóa.",
        "D": "Góp phần hạn chế tầm ảnh hưởng của Nhật Bản."
      },
      "correct_answer": "B",
      "explanation": {
        "method": "Xem lại nội dung về quan hệ quốc tế sau Chiến tranh lạnh.",
        "solution": "Việc hình thành xu thế đa cực, nhiều trung tâm sau Chiến tranh lạnh góp phần củng cố hòa bình, an ninh quốc tế."
      }
    },
    {
      "question_id": 5,
      "source": "Tuyen Quang",
      "question_text": "Sau Chiến tranh thế giới thứ hai, chủ nghĩa xã hội được mở rộng ở khu vực nào dưới đây?",
      "options": {
        "A": "Bắc Âu.",
        "B": "Châu Á.",
        "C": "Bắc Mỹ.",
        "D": "Nam Phi."
      },
      "correct_answer": "B",
      "explanation": {
        "method": "Xem lại nội dung về sự phát triển của chủ nghĩa xã hội sau Chiến tranh thế giới thứ hai.",
        "solution": "Sau Chiến tranh thế giới thứ hai, chủ nghĩa xã hội được mở rộng chủ yếu ở khu vực châu Á."
      }
    }
  ],
  "phan_ii": [
  ]
}